# coding: utf-8

Card.delete_all

# race
# 1:植物
# 2:動物
# 3:人間
# 4:メカ

# :name, :race1, :race2, :race3, :race4, :hp, :cost, :skill1 => {:name, :damage, :cost, :element, :text}, :skill2 => {:name, :damage, :cost, :element, :text}, :effect, :flavor
c = []
c << ["消防車",         4, 3,   nil, nil, 4,  3,  ["放水", 2, 2, "水撃", "水の発生源がある場合、コストを必要とせず、消費しなくてもよい"], ["突進", 2, 0, "打撃", "自分に1のダメージ"], nil, nil]
c << ["人口太陽",       4, nil, nil, nil, 20, 20, ["フレア", 5, 5, "火撃", "敵全員にダメージを与える"], ["超新星", 50, 10, "打撃", "このモンスターのHPは0になる"], "光の発生源\n火の発生源\n飛行", nil]
c << ["不思議花",       1, nil, nil, nil, 5,  4,  ["ソーラービーム", 3, 2, "光線", "光の発生源がある場合、コストを必要とせず、消費しなくてもよい"], nil, nil, nil]
c << ["魔力ポット",     4, nil, nil, nil, 1,  2,  ["体当たり", 1, 1, "打撃", nil], nil, "自分のターン開始時に、MP + 1", nil]
c << ["蜂",             2, nil, nil, nil, 2,  1,  ["毒針", 1, 0, "毒撃", nil], ["神経毒", 0, 0, "毒撃", "攻撃相手がメカ以外なら、次のターン行動不能にする"], nil, nil]
c << ["強化ミミズ",     2, nil, nil, nil, 1,  1,  ["這いずり", 1, 0, "打撃", nil], nil, nil, nil]
c << ["カッパ",         2, nil, nil, nil, 4,  2,  ["攻撃", 2, 2, "打撃", nil], nil, "火の発生源が存在する時は、HPが1減った状態で場に出る", nil]
c << ["スタンビートル", 2, 4,   nil, nil, 1,  3,  ["スタンガン", 2, 2, "雷撃", "電気の発生源がある場合威力が5になる"], nil, nil, nil]
c << ["イタチ",         2, nil, nil, nil, 2,  3,  ["きょろきょろ", 0, 0, nil, "次に受けるダメージ 0"], ["ひっかく", 2, 1, "打撃", nil], nil, nil]
c << ["テスターマウス", 2, nil, nil, nil, 1,  0,  nil, nil, nil, nil]
c << ["カラス",         4, nil, nil, nil, 1,  1,  ["鳴き声", 0, 1, nil, "指定したモンスターの技威力を、次の自分のターン開始時まで -2"], ["つつく", 1, 1, "打撃", nil], nil, nil]
c << ["苗木",           1, nil, nil, nil, 1,  1,  ["成長", 0, 1, nil, "技を使った次のターン開始時、苗木を破壊し、デッキか手札から若木を召還する"], ["刺", 1, 2, "打撃", "1/2の確率で、攻撃が失敗する"], nil, nil]
c << ["若木",           1, nil, nil, nil, 4,  3,  ["成長", 0, 3, nil, "技を使った次のターン開始時、若木を破壊し、デッキか手札から巨木を召還する"], ["刺", 2, 2, "打撃", "1/2の確率で、攻撃が失敗する"], nil, nil]
c << ["巨木",           1, nil, nil, nil, 7,  5,  ["成長", 0, 5, nil, "技を使った次のターン開始時、巨木を破壊し、デッキか手札から老木を召還する"], ["刺", 5, 2, "打撃", nil], nil, nil]
c << ["老木",           1, nil, nil, nil, 11, 9,  ["若返り", 0, 0, nil, "技を使った次のターン開始時、老木を破壊し、デッキか手札から苗木を召還する"], ["刺", 9, 2, "打撃", "攻撃相手がメカ以外なら、1/2の確率でそのモンスターを破壊する"], nil, nil]
c << ["亀",             2, nil, nil, nil, 5,  2,  ["殻にこもる", 0, 1, nil, "受けるダメージが半分になる(切り上げ)"], ["殻にこもる", 0, 2, nil, "受けるダメージが半分になる(切り下げ)"], nil, nil]
c << ["動く鎧",         4, 3,   nil, nil, 4,  3,  ["防御", 0, 2, nil, "1回だけ、受けるダメージを3軽減する"], ["剣技", 2, 2, "斬撃", nil], nil, nil]
c << ["狂犬",           2, nil, nil, nil, 3,  2,  ["凶暴化", 0, 1, nil, "次に与えるダメージ + 3"], ["噛み付く", 2, 2, "打撃", nil], nil, nil]
c << ["猫又",           2, nil, nil, nil, 6,  4,  ["長寿", 0, 1, nil, "猫又のHPを2回復"], ["ひっかく", 2, 1, "打撃", nil], nil, nil]
c << ["アジサイ",       1, nil, nil, nil, 1,  1,  ["甘い香り", 0, 0, nil, "主人のHPを1回復"], nil, nil, nil]
c << ["男子高校生",     3, nil, nil, nil, 2,  2,  ["格闘", 2, 1, "打撃", nil], nil, nil, nil]
c << ["女子高生",       3, nil, nil, nil, 2,  1,  ["格闘", 1, 0, "打撃", nil], nil, nil, nil]
c << ["システムエンジニア", 3, nil, nil, nil, 2, 2, ["ハッキング", 0, 3, nil, "攻撃対象がメカの場合、そのモンスターのHPを1にする"], ["DMLプログラミング", 0, 2, nil, "山札からコスト2以下のモンスターを1枚選び、手札に加える"], nil, nil]
c << ["バイオハッカー", 3, nil, nil, nil, 2,  2,  ["マスタードガス", 0, 3, nil, "攻撃対象が人間か動物の場合、そのモンスターのHPを1にする"], ["リペアきっと", 0, 3, nil, "人間、動物、植物モンスター1体を選択し、そのモンスターのHPを全回復する"], nil, nil]
c << ["フェニックス",   2, 4,   nil, nil, 3,  5,  ["バーストアタック", 5, 2, "火撃", nil], nil, "自分のターン開始時に、このモンスター以外のモンスター全員に1ダメージ", nil]
c << ["スナイパー",     3, nil, nil, nil, 2,  3,  ["スナイプ", 1, 3, "打撃", "マスターにも攻撃できる"], nil, nil, nil]
c << ["ボムキャリアー", 4, nil, nil, nil, 2,  4,  ["ボム", 3, 4, "打撃", "攻撃対象の左右にいるモンスターにも2ダメージ"], nil, nil, nil]
c << ["ハイドロイド",   3, 4,   nil, nil, 3,  4,  ["ウォーターガン", 3, 3, "水撃", "相手マスターにも2ダメージ"], ["ウォーターガン", 1, 3, "水撃", "相手モンスター全員にダメージ"], nil, nil]
c << ["ナイフファルコン", 2, 4, nil, nil, 4,  5,  ["突撃", 4, 2, "打撃", nil], ["フェザーナイフ", 2, 4, "打撃", "マスターにも攻撃できる"], nil, nil]
c << ["ビッグマウス",   3, 2,   nil, nil, 2,  3,  ["噛み付き", 2, 0, "打撃", nil], nil, nil, nil]
c << ["投石機",         4, nil, nil, nil, 3,  4,  ["投石", 0, 3, "打撃", "6のダメージを、好きな数のモンスターに割り振る事ができる。(1つのモンスターには、最低1、最大2まで割り振れる)"], nil, nil, nil]
c << ["宿り木",         1, nil, nil, nil, 1,  1,  ["養分吸収", 0, 0, nil, "モンスター1体を選択し、HPを1減らす。減らす事に成功した場合、代わりに別のモンスター1体を選択し、HPを1回復する"], ["子孫繁栄", 0, 0, nil, "次の自分のターン開始時までに宿り木が墓地に送られた場合、次の自分のターンか開始時に宿り木を場に召還する事ができる。"], nil, nil]


c.each do |p|
  Card.create! :name  => p[0],
               :race1 => p[1],
               :race2 => p[2],
               :race3 => p[3],
               :race4 => p[4],
               :hp    => p[5],
               :cost  => p[6],

               :skill1_name    => p[7] ? p[7][0] : nil,
               :skill1_damage  => p[7] ? p[7][1] : nil,
               :skill1_cost    => p[7] ? p[7][2] : nil,
               :skill1_element => p[7] ? p[7][3] : nil,
               :skill1_text    => p[7] ? p[7][4] : nil,

               :skill2_name    => p[8] ? p[8][0] : nil,
               :skill2_damage  => p[8] ? p[8][1] : nil,
               :skill2_cost    => p[8] ? p[8][2] : nil,
               :skill2_element => p[8] ? p[8][3] : nil,
               :skill2_text    => p[8] ? p[8][4] : nil,

               :effect => p[9],
               :flavor => p[10]
end
